Kap3/Kap3.org
\chapter{Marco Práctico}
#+OPTIONS:  \n:t

* Esquema general del proyecto
  
El objetivo principal de este proyecto es la medición y grabación de señales EEG digitalmente. En esta sección del documento se detallará el proceso llevado acabo para el desarrollo de un prototipo funcional capaz de satisfacer todos los objetivos propuestos. Para la realización de un prototipo funcional se debe considerar las recomendaciones de la IFCN; alcanzar una resolución de la señal hasta 0.5µV con un rechazo de nodo común de 110dB y el ruido adicional debe ser menor de 1.5 µVpp y 0.5 µV raíz media cuadrada a cualquier frecuencia.

El camino más indicado, como se analizará más profundamente en los siguientes incisos, para aproximarse a estas recomendaciones es la implementación de un diseño en placa de circuito impreso con componentes de montaje superficial. Con fines de asegurar el correcto funcionamiento se realizará la implementación a través de un servicio de prototipado en planta industrial. Para ello, sin embargo, es imprescindible la simulación completa en la etapa de diseño.

Diseño-simulacion-prototipado-validacion DIAGRAMA

1. Que antecedentes de diseño se va a utilizar
   1. Analog Front End [32ch, IFCN]
   2. OpenBCI ADC for EEG
   3. Power Consumption and Security [ModularEEG, Proj wireless]

2. Como optimizar el diseño para modularidad
   1. Entrada Electrodos OpenBCI Compatible
   2. AFE enhancement, OpenBCI Compatible
   3. ADC - SPI - µC-/µP
   4. Alimentación



* Diseño
** Requerimientos
   1. Revisión de Documentos (IFCN)
   | Value            | Consideraciones           | Descripción                  |
   |------------------+---------------------------+------------------------------|
   | >=24             | Preferible 32             | Número de Canales            |
   | >=200Hz          | Múltiplo de 50 o 64       | Frecuencia de Muestreo       |
   | >=70 Hz 12db/oct | Sample Rate (200 min)     | Anti-Aliasing LP Filtro      |
   | ~0.16 Hz         | Higher Discouraged        | DC-Offset HP Filtro          |
   | 50-50 Hz         | Available, not permanent  | Notch Filtro                 |
   | >=12 bit         | 0.5µV Resolucion de señal | Resolucion ADC               |
   | >=110dB          | Medido en la entrada      | CMRR                         |
   | 1.5µVpp          | Incluyendo 50-60 Hz       | Ruido a cualquier frecuencia |
** Cálculos / dimensionamiento
   2. Selección de Topología y Arquitectura
   | Value    |          | Topologia              | Descripción             |
   |----------+----------+------------------------+-------------------------|
   | 70 Hz    | 12dB/oct | MFB Butterworth        | Anti-Aliasing LP Filtro |
   | 0.16 Hz  | 8dB/oct  | Sallen-Key Butterworth | DC-Offset HP Filtro     |
   | 50-50 Hz |          | Digital                | Filtro Rechaza Banda    |
   | 2.54     |          | Ganancia en INA        | Ganancia Total          |

   2. Teorico 
   | Value   | Topologia         | Descripción         |
   |---------+-------------------+---------------------|
   | 110dB   | MFB Butterworth   | CMRR                |
   | 2.54    | Ganancia          | DC-Offset HP Filtro |
   | 10µV    | PGA x10 ADC 24bit | Resoulción LSB      |
   | 0.16-80 |                   | Banda a -20dB       |
 
** Desarrollo
*** AFE
    1. que es afe
    2. Diseño automatizado Analog wizard +anexos
       1. Características LP 4stage
       2. Características HP 4stage
*** ADC
    1) Que es ADC
    2) Open BCI módulos
    3) Ganglion Block diagram (circuito anexo)
    4) ADS1299 Series
    5) ADS129x Series
    6) *Compatibilidad
    7) Comparativa Circuito Open BCI vs TI ADS1299
    8) Circuito Eagle (anexo)

*** Diseño módulo de alimentación y Simulación térmica
1. Copiar diseño PWR (Modular EEG, OpenBCI, Datasheet) y simulación termica
**** Requerimientos
   - Bateria y USB
   - Voltage Rails
   - Analyze Virtual GND
   - Analisis consumo
   | Componente | Consumo | Cant | Moudlo |
   |------------+---------+------+--------|
   |            |         |    1 | pwr    |
   |            |         |      |        |
   |            |         |      |        |
**** Cálculos / dimensionamiento
   1. Cálculo de requerimientos; expansibilidad y flexiblidad (bateria, linea)
   2. Grafico extrapolación potencia vs. voltaje
   3. corriente reguladores
**** Desarrollo
   1. Datasheet y Open Source
   2. Diseño Modular EEG Bloques (circuito Anexo)
   3. diseño modular Open BCI Bloques (circuito Anexo)
   4. Circuito unificado (circuito anexo)
   5. MEJ02

* Simulación
** LT Spice
    1. Simulación LT Spice
       1. Filtros PB-PA
       2. INA
       3. Bode
       4. Señales Continuas (sq/sin/triang/eeg)
    2. Circuito Eagle (anexo)
    3. Open BCI circuito ESD+Filtro
** Eagle
    5. Modelado CAD
       1. Diseño esquemático
       2. Consolidación de Librería de componentes
          1. Shcematic pinout
          2. Board Packaging
          3. Board Legends
          4. 3D model
       3. Diseño Board Modular
       4. Leyendas
** Fusion 360 - Thermal sim
   1. Exportar Fusion 360
   2. Simplificar diseño
   3. Modelado materiales
   4. Carga potencia
   5. Resultados
* Prototipado
   1) Generación de BOM (anexo)
   2) Cotización (anexo)
   3) *resoulción de inconsistencias (anexo)
   4) Panelización/Gerbers (anexo)
      1) Vrails
      2) Dimensions
   5) Logística y Ensamblaje
   6) Cableado
* Software
** Servidores
- Custom Go Compilation
- DockerFile
** Firmware
- Time Tag
- Dual Core (async)
* Func Gen
* Pruebas
** Requerimientos
   - Objetivos Específicos
** Cálculos / dimensionamiento
** Desarrollo
1. Pruebas
   1. Lineas de Voltaje
      1. precisión
      2. estabilidad
   2. Filtros características
      1. Bode 
      2. FFT
      3. Señal Sintética Base.
   3. ADC 
      1. Comunicación SPI
      2. Precisión voltaje de Referencia y PGA
      3. 200Hz+ Sample rate test comparison with oscilloscope 
   4. Software
      1. MQTT Python Client Stress Test
      2. Docker stability?
      3. Data loss length thest

* ***Enclosure?***
* Herramientas
** Hardware
  200 Palabras máximo por cada herramienta.
*** ESP 32
*** USB Test Meter
*** DScope
*** Analizador de lógica
*** Multimetro, Cautin, Cables Dupont
** Software
  200 Palabras maximo por cada herramienta.
*** Analog Filter Wizard
*** Eagle CAD
*** LT SPICE
*** Fusion 360
*** SigRok/PulseView
*** Docker
*** Go
*** Mosquitto
*** MQTT On-Off IOS App
*** EMACS arduino-cli (esptool)
* Resultados y discusión

* Análisis de Costos
